LindezaGrey/ultrawatch/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Flash / PSRAM (T-Watch Ultra: 16 MB QSPI flash, 8 MB QSPI PSRAM)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# Watch app: dual-core, ample stack
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Lets the "stacks" debug command (main/debug_cmds.c) enumerate every task's
# real high-water-mark stack usage via uxTaskGetSystemState() - needed to
# right-size task stacks empirically instead of guessing, since internal
# DMA-capable RAM is chronically tight here (see docs/application.md
# section 12) and every task stack claims a piece of it.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# App version (shown on the boot screen with the git commit hash)
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
CONFIG_APP_PROJECT_VER="1.0.0"

# Partition table: custom (nvs / phy_init / 2 MB factory app / 512K coredump / 1 MB assets)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Crash core dump: store to flash on panic, decoded to the SD card on next boot
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=32

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# JTAG/OCD-aware debug (on-chip JTAG, FreeRTOS-aware GDB)
CONFIG_ESP32S3_DEBUG_OCDAWARE=y

# Power management: DFS + automatic light sleep
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_PM_SLP_DISABLE_GPIO=y
CONFIG_PM_LIGHTSLEEP_TICK_OVERFLOW_PROTECTION=y

# LVGL (esp_lvgl_adapter)
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OBJ_STYLE_CACHE=y
# 2 -> 1: each SW draw-render thread needs LV_DRAW_THREAD_STACK_SIZE
# (32 KB below, required by FreeType/high-DPI fonts, not reducible) - a
# second parallel render worker doubles that to 64 KB, the single
# biggest internal-RAM consumer found on this board (bigger than every
# app task stack combined, see docs/application.md section 12). This UI
# (status bar, clock, lists) isn't draw-heavy enough to need 2-way
# parallel rendering; 1 halves the cost to 32 KB.
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1

# High-DPI fonts: FreeType (vector) for the ~315 PPI AMOLED
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FREETYPE=y
CONFIG_LV_USE_FREETYPE=y
CONFIG_LV_DRAW_THREAD_STACK_SIZE=32768
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_22=y
# 28: watch face's own status bar (double-size icons, see build_status_bar_big()).
CONFIG_LV_FONT_MONTSERRAT_28=y

# Console over USB-Serial-JTAG only (no UART): frees UART0/GPIO43-44 for GNSS.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set

# BLE debug bridge (NimBLE host). Use PSRAM for the NimBLE buffers: the app's
# LVGL/FreeType already consumes most of the small internal heap.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_LOG_LEVEL_DEBUG=y
# The controller's own buffers (BLE_INIT, below the NimBLE host layer
# above) can't use PSRAM at all - confirmed live: a scan-only Observer
# role still failed its static RX buffer allocation against internal RAM
# alone (BLE_INIT: Malloc failed -> watchdog panic). BLE_MAX_ACT reserves
# per-activity (connection+scan+advertise) memory; a scan-only feature
# never needs more than 1 concurrent activity, down from the IDF default
# of 6.
CONFIG_BT_CTRL_BLE_MAX_ACT=1

# LVGL logging: ON at error level, deliberately.
# LVGL's default LV_ASSERT_HANDLER is `while(1);` and there is no Kconfig
# option to change it, so a failed assert halts the LVGL task forever. With
# logging compiled out that halt is completely silent - it cost three
# debugging sessions before lv_scr_load(NULL) was identified as the cause of a
# recurring "watch freezes, touch dead" fault (see settings_back_cb). Error
# level only, so this prints when something is already badly wrong and is
# otherwise quiet.
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_ERROR=y
CONFIG_LV_LOG_PRINTF=y
